name: "bert"
platform: "tensorrt_plan"
max_batch_size:  8

input [
  { name: "input_ids"      data_type: TYPE_INT32 dims: [ 512 ] },
  { name: "attention_mask" data_type: TYPE_INT32 dims: [ 512 ] }
]

output [
  { name: "logits" data_type: TYPE_FP32 dims: [ 1 ] reshape: { shape: [ ] } }
]

instance_group [
  { kind: KIND_GPU   count: 1 }
]

dynamic_batching {
    preferred_batch_size: [1]
}
